; domain
(define
	(domain bagend)
	(:requirements :adl)
	(:types color room ball block field)
	(:constants null - block)
	(:predicates
		(passage ?r1 ?r2 - room ?c - color)
		(merry-w ?r - room)
		(ball-w ?b - ball ?r - room)
		(merry-ma ?b - ball)
		(ball-color ?b - ball ?c - color)
		(blockade-in ?r - room)
		(next-to ?f1 ?f2 - field)
		(number-on ?k - block ?f - field)
	)
	(:action wez 
		:parameters (?c - color ?b - ball ?r - room)
		:precondition
		(and
			(ball-color ?b ?c)
			(ball-w ?b ?r)
			(merry-w ?r)
		)
		:effect
		(and
			(merry-ma ?b)
			(not (ball-w ?b ?r))
		)
	)
	(:action idz
		:parameters (?rTo ?rFrom - room ?c - color ?b - ball)
		:precondition
		(and
			(merry-w ?rFrom)
			(passage ?rFrom ?rTo ?c)
			(merry-ma ?b)
			(ball-color ?b ?c) 
		)
		:effect
		(and
			(not (merry-ma ?b))
			(not (merry-w ?rFrom))
			(merry-w ?rTo)
		)
	)
	(:action przesun
		:parameters (?k - block ?f1 ?f2 - field ?r - room)
		:precondition
		(and
			(not (= ?k null))
			(blockade-in ?r)
			(merry-w ?r)
			(or (next-to ?f1 ?f2)(next-to ?f2 ?f1))
			(number-on ?k ?f1)
			(number-on null ?f2)
		)
		:effect
		(and
			(number-on null ?f1)
			(number-on ?k ?f2)
			(not (number-on ?k ?f1))
			(not (number-on null ?f2))
		)
	)
	
)

; problem
(define (problem p1)
	(:domain bagend)
	(:objects
		zielony czerwony pomaranczowy rozowy niebieski - color
		za rb pc nc zd cd ne ze nf1 nf2 zh ch pi ni - ball
		A B C D E F G H I - room
		k1 k2 k3 k4 k5 k6 k7 k8 - block
		f1 f2 f3 f4 f5 f6 f7 f8 f9 - field
	)
	(:init
		(passage A B pomaranczowy)
		(passage A C czerwony)
		(passage C A czerwony)
		(passage B D pomaranczowy)
		(passage C E zielony)
		(passage E C zielony)
		(passage D F zielony)
		(passage F D zielony)
		(passage E F niebieski)
		(passage F E niebieski)
		(passage F G rozowy)
		(passage F I niebieski)
		(passage I F niebieski)
		(passage E H czerwony)
		(passage H E czerwony)
		(passage H I niebieski)
		(passage I H niebieski)
		(ball-color za zielony)
		(ball-color rb rozowy)
		(ball-color pc pomaranczowy)
		(ball-color nc niebieski)
		(ball-color zd zielony)
		(ball-color cd czerwony)
		(ball-color ne niebieski)
		(ball-color ze zielony)
		(ball-color nf1 niebieski)
		(ball-color nf2 niebieski)
		(ball-color zh zielony)
		(ball-color ch czerwony)
		(ball-color pi pomaranczowy)
		(ball-color ni niebieski)
		(ball-w za A)
		(ball-w rb B)
		(ball-w pc C)
		(ball-w nc C)
		(ball-w zd D)
		(ball-w cd D)
		(ball-w ne E)
		(ball-w ze E)
		(ball-w nf1 F)
		(ball-w nf2 F)
		(ball-w zh H)
		(ball-w ch H)
		(ball-w pi I)
		(ball-w ni I)
		(merry-w F)
		(blockade-in A)
		
		(next-to f1 f2)
		(next-to f2 f3)
		(next-to f4 f5)
		(next-to f5 f6)
		(next-to f7 f8)
		(next-to f8 f9)
		(next-to f1 f4)
		(next-to f4 f7)
		(next-to f2 f5)
		(next-to f5 f8)
		(next-to f3 f6)
		(next-to f6 f9)
		(number-on k5 f1)
		(number-on k4 f2)
		(number-on k1 f3)
		(number-on k8 f4)
		(number-on null f5)
		(number-on k3 f6)
		(number-on k7 f7)
		(number-on k2 f8)
		(number-on k6 f9)
	)
	(:goal
		(and
			(merry-w G)
			(number-on k1 f1)
			(number-on k2 f2)
			(number-on k3 f3)
			(number-on k4 f4)
			(number-on k5 f5)
			(number-on k6 f6)
			(number-on k7 f7)
			(number-on k8 f8)
			(number-on null f9)
		)
	)
)

; plan
1. (wez niebieski nf1 f)
   deleted: (ball-w nf1 f)
   added: (merry-ma nf1)
   goals met: 1 of 10
2. (idz i f niebieski nf1)
   deleted: (merry-ma nf1) (merry-w f)
   added: (merry-w i)
   goals met: 1 of 10
3. (wez niebieski ni i)
   deleted: (ball-w ni i)
   added: (merry-ma ni)
   goals met: 1 of 10
4. (wez pomaranczowy pi i)
   deleted: (ball-w pi i)
   added: (merry-ma pi)
   goals met: 1 of 10
5. (idz h i niebieski ni)
   deleted: (merry-ma ni) (merry-w i)
   added: (merry-w h)
   goals met: 1 of 10
6. (wez czerwony ch h)
   deleted: (ball-w ch h)
   added: (merry-ma ch)
   goals met: 1 of 10
7. (wez zielony zh h)
   deleted: (ball-w zh h)
   added: (merry-ma zh)
   goals met: 1 of 10
8. (idz e h czerwony ch)
   deleted: (merry-ma ch) (merry-w h)
   added: (merry-w e)
   goals met: 1 of 10
9. (wez niebieski ne e)
   deleted: (ball-w ne e)
   added: (merry-ma ne)
   goals met: 1 of 10
10. (idz f e niebieski ne)
   deleted: (merry-ma ne) (merry-w e)
   added: (merry-w f)
   goals met: 1 of 10
11. (wez niebieski nf2 f)
   deleted: (ball-w nf2 f)
   added: (merry-ma nf2)
   goals met: 1 of 10
12. (idz d f zielony zh)
   deleted: (merry-ma zh) (merry-w f)
   added: (merry-w d)
   goals met: 1 of 10
13. (wez zielony zd d)
   deleted: (ball-w zd d)
   added: (merry-ma zd)
   goals met: 1 of 10
14. (wez czerwony cd d)
   deleted: (ball-w cd d)
   added: (merry-ma cd)
   goals met: 1 of 10
15. (idz f d zielony zd)
   deleted: (merry-ma zd) (merry-w d)
   added: (merry-w f)
   goals met: 1 of 10
16. (idz e f niebieski nf2)
   deleted: (merry-ma nf2) (merry-w f)
   added: (merry-w e)
   goals met: 1 of 10
17. (wez zielony ze e)
   deleted: (ball-w ze e)
   added: (merry-ma ze)
   goals met: 1 of 10
18. (idz c e zielony ze)
   deleted: (merry-ma ze) (merry-w e)
   added: (merry-w c)
   goals met: 1 of 10
19. (wez pomaranczowy pc c)
   deleted: (ball-w pc c)
   added: (merry-ma pc)
   goals met: 1 of 10
20. (idz a c czerwony cd)
   deleted: (merry-ma cd) (merry-w c)
   added: (merry-w a)
   goals met: 1 of 10
21. (przesun k8 f4 f5 a)
   deleted: (number-on k8 f4) (number-on null f5)
   added: (number-on null f4) (number-on k8 f5)
   goals met: 1 of 10
22. (przesun k7 f7 f4 a)
   deleted: (number-on k7 f7) (number-on null f4)
   added: (number-on null f7) (number-on k7 f4)
   goals met: 0 of 10
23. (przesun k2 f8 f7 a)
   deleted: (number-on k2 f8) (number-on null f7)
   added: (number-on null f8) (number-on k2 f7)
   goals met: 0 of 10
24. (przesun k8 f5 f8 a)
   deleted: (number-on k8 f5) (number-on null f8)
   added: (number-on null f5) (number-on k8 f8)
   goals met: 1 of 10
25. (przesun k4 f2 f5 a)
   deleted: (number-on k4 f2) (number-on null f5)
   added: (number-on null f2) (number-on k4 f5)
   goals met: 1 of 10
26. (przesun k5 f1 f2 a)
   deleted: (number-on k5 f1) (number-on null f2)
   added: (number-on null f1) (number-on k5 f2)
   goals met: 1 of 10
27. (przesun k7 f4 f1 a)
   deleted: (number-on k7 f4) (number-on null f1)
   added: (number-on null f4) (number-on k7 f1)
   goals met: 1 of 10
28. (przesun k4 f5 f4 a)
   deleted: (number-on k4 f5) (number-on null f4)
   added: (number-on null f5) (number-on k4 f4)
   goals met: 2 of 10
29. (przesun k3 f6 f5 a)
   deleted: (number-on k3 f6) (number-on null f5)
   added: (number-on null f6) (number-on k3 f5)
   goals met: 2 of 10
30. (przesun k1 f3 f6 a)
   deleted: (number-on k1 f3) (number-on null f6)
   added: (number-on null f3) (number-on k1 f6)
   goals met: 2 of 10
31. (przesun k5 f2 f3 a)
   deleted: (number-on k5 f2) (number-on null f3)
   added: (number-on null f2) (number-on k5 f3)
   goals met: 2 of 10
32. (przesun k3 f5 f2 a)
   deleted: (number-on k3 f5) (number-on null f2)
   added: (number-on null f5) (number-on k3 f2)
   goals met: 2 of 10
33. (przesun k1 f6 f5 a)
   deleted: (number-on k1 f6) (number-on null f5)
   added: (number-on null f6) (number-on k1 f5)
   goals met: 2 of 10
34. (przesun k5 f3 f6 a)
   deleted: (number-on k5 f3) (number-on null f6)
   added: (number-on null f3) (number-on k5 f6)
   goals met: 2 of 10
35. (przesun k3 f2 f3 a)
   deleted: (number-on k3 f2) (number-on null f3)
   added: (number-on null f2) (number-on k3 f3)
   goals met: 3 of 10
36. (przesun k1 f5 f2 a)
   deleted: (number-on k1 f5) (number-on null f2)
   added: (number-on null f5) (number-on k1 f2)
   goals met: 3 of 10
37. (przesun k5 f6 f5 a)
   deleted: (number-on k5 f6) (number-on null f5)
   added: (number-on null f6) (number-on k5 f5)
   goals met: 4 of 10
38. (przesun k6 f9 f6 a)
   deleted: (number-on k6 f9) (number-on null f6)
   added: (number-on null f9) (number-on k6 f6)
   goals met: 6 of 10
39. (wez zielony za a)
   deleted: (ball-w za a)
   added: (merry-ma za)
   goals met: 6 of 10
40. (przesun k8 f8 f9 a)
   deleted: (number-on k8 f8) (number-on null f9)
   added: (number-on null f8) (number-on k8 f9)
   goals met: 4 of 10
41. (przesun k2 f7 f8 a)
   deleted: (number-on k2 f7) (number-on null f8)
   added: (number-on null f7) (number-on k2 f8)
   goals met: 4 of 10
42. (przesun k4 f4 f7 a)
   deleted: (number-on k4 f4) (number-on null f7)
   added: (number-on null f4) (number-on k4 f7)
   goals met: 3 of 10
43. (przesun k7 f1 f4 a)
   deleted: (number-on k7 f1) (number-on null f4)
   added: (number-on null f1) (number-on k7 f4)
   goals met: 3 of 10
44. (przesun k1 f2 f1 a)
   deleted: (number-on k1 f2) (number-on null f1)
   added: (number-on null f2) (number-on k1 f1)
   goals met: 4 of 10
45. (przesun k5 f5 f2 a)
   deleted: (number-on k5 f5) (number-on null f2)
   added: (number-on null f5) (number-on k5 f2)
   goals met: 3 of 10
46. (przesun k2 f8 f5 a)
   deleted: (number-on k2 f8) (number-on null f5)
   added: (number-on null f8) (number-on k2 f5)
   goals met: 3 of 10
47. (przesun k4 f7 f8 a)
   deleted: (number-on k4 f7) (number-on null f8)
   added: (number-on null f7) (number-on k4 f8)
   goals met: 3 of 10
48. (przesun k7 f4 f7 a)
   deleted: (number-on k7 f4) (number-on null f7)
   added: (number-on null f4) (number-on k7 f7)
   goals met: 4 of 10
49. (przesun k2 f5 f4 a)
   deleted: (number-on k2 f5) (number-on null f4)
   added: (number-on null f5) (number-on k2 f4)
   goals met: 4 of 10
50. (przesun k5 f2 f5 a)
   deleted: (number-on k5 f2) (number-on null f5)
   added: (number-on null f2) (number-on k5 f5)
   goals met: 5 of 10
51. (przesun k3 f3 f2 a)
   deleted: (number-on k3 f3) (number-on null f2)
   added: (number-on null f3) (number-on k3 f2)
   goals met: 4 of 10
52. (przesun k6 f6 f3 a)
   deleted: (number-on k6 f6) (number-on null f3)
   added: (number-on null f6) (number-on k6 f3)
   goals met: 3 of 10
53. (przesun k5 f5 f6 a)
   deleted: (number-on k5 f5) (number-on null f6)
   added: (number-on null f5) (number-on k5 f6)
   goals met: 2 of 10
54. (przesun k2 f4 f5 a)
   deleted: (number-on k2 f4) (number-on null f5)
   added: (number-on null f4) (number-on k2 f5)
   goals met: 2 of 10
55. (przesun k1 f1 f4 a)
   deleted: (number-on k1 f1) (number-on null f4)
   added: (number-on null f1) (number-on k1 f4)
   goals met: 1 of 10
56. (przesun k3 f2 f1 a)
   deleted: (number-on k3 f2) (number-on null f1)
   added: (number-on null f2) (number-on k3 f1)
   goals met: 1 of 10
57. (przesun k2 f5 f2 a)
   deleted: (number-on k2 f5) (number-on null f2)
   added: (number-on null f5) (number-on k2 f2)
   goals met: 2 of 10
58. (przesun k4 f8 f5 a)
   deleted: (number-on k4 f8) (number-on null f5)
   added: (number-on null f8) (number-on k4 f5)
   goals met: 2 of 10
59. (przesun k8 f9 f8 a)
   deleted: (number-on k8 f9) (number-on null f8)
   added: (number-on null f9) (number-on k8 f8)
   goals met: 4 of 10
60. (przesun k5 f6 f9 a)
   deleted: (number-on k5 f6) (number-on null f9)
   added: (number-on null f6) (number-on k5 f9)
   goals met: 3 of 10
61. (przesun k6 f3 f6 a)
   deleted: (number-on k6 f3) (number-on null f6)
   added: (number-on null f3) (number-on k6 f6)
   goals met: 4 of 10
62. (przesun k2 f2 f3 a)
   deleted: (number-on k2 f2) (number-on null f3)
   added: (number-on null f2) (number-on k2 f3)
   goals met: 3 of 10
63. (przesun k3 f1 f2 a)
   deleted: (number-on k3 f1) (number-on null f2)
   added: (number-on null f1) (number-on k3 f2)
   goals met: 3 of 10
64. (przesun k1 f4 f1 a)
   deleted: (number-on k1 f4) (number-on null f1)
   added: (number-on null f4) (number-on k1 f1)
   goals met: 4 of 10
65. (przesun k4 f5 f4 a)
   deleted: (number-on k4 f5) (number-on null f4)
   added: (number-on null f5) (number-on k4 f4)
   goals met: 5 of 10
66. (przesun k3 f2 f5 a)
   deleted: (number-on k3 f2) (number-on null f5)
   added: (number-on null f2) (number-on k3 f5)
   goals met: 5 of 10
67. (przesun k2 f3 f2 a)
   deleted: (number-on k2 f3) (number-on null f2)
   added: (number-on null f3) (number-on k2 f2)
   goals met: 6 of 10
68. (przesun k6 f6 f3 a)
   deleted: (number-on k6 f6) (number-on null f3)
   added: (number-on null f6) (number-on k6 f3)
   goals met: 5 of 10
69. (przesun k3 f5 f6 a)
   deleted: (number-on k3 f5) (number-on null f6)
   added: (number-on null f5) (number-on k3 f6)
   goals met: 5 of 10
70. (przesun k8 f8 f5 a)
   deleted: (number-on k8 f8) (number-on null f5)
   added: (number-on null f8) (number-on k8 f5)
   goals met: 4 of 10
71. (przesun k5 f9 f8 a)
   deleted: (number-on k5 f9) (number-on null f8)
   added: (number-on null f9) (number-on k5 f8)
   goals met: 5 of 10
72. (przesun k3 f6 f9 a)
   deleted: (number-on k3 f6) (number-on null f9)
   added: (number-on null f6) (number-on k3 f9)
   goals met: 4 of 10
73. (przesun k8 f5 f6 a)
   deleted: (number-on k8 f5) (number-on null f6)
   added: (number-on null f5) (number-on k8 f6)
   goals met: 4 of 10
74. (przesun k5 f8 f5 a)
   deleted: (number-on k5 f8) (number-on null f5)
   added: (number-on null f8) (number-on k5 f5)
   goals met: 5 of 10
75. (przesun k3 f9 f8 a)
   deleted: (number-on k3 f9) (number-on null f8)
   added: (number-on null f9) (number-on k3 f8)
   goals met: 6 of 10
76. (przesun k8 f6 f9 a)
   deleted: (number-on k8 f6) (number-on null f9)
   added: (number-on null f6) (number-on k8 f9)
   goals met: 5 of 10
77. (przesun k6 f3 f6 a)
   deleted: (number-on k6 f3) (number-on null f6)
   added: (number-on null f3) (number-on k6 f6)
   goals met: 6 of 10
78. (przesun k2 f2 f3 a)
   deleted: (number-on k2 f2) (number-on null f3)
   added: (number-on null f2) (number-on k2 f3)
   goals met: 5 of 10
79. (przesun k5 f5 f2 a)
   deleted: (number-on k5 f5) (number-on null f2)
   added: (number-on null f5) (number-on k5 f2)
   goals met: 4 of 10
80. (przesun k3 f8 f5 a)
   deleted: (number-on k3 f8) (number-on null f5)
   added: (number-on null f8) (number-on k3 f5)
   goals met: 4 of 10
81. (przesun k8 f9 f8 a)
   deleted: (number-on k8 f9) (number-on null f8)
   added: (number-on null f9) (number-on k8 f8)
   goals met: 6 of 10
82. (przesun k6 f6 f9 a)
   deleted: (number-on k6 f6) (number-on null f9)
   added: (number-on null f6) (number-on k6 f9)
   goals met: 4 of 10
83. (przesun k3 f5 f6 a)
   deleted: (number-on k3 f5) (number-on null f6)
   added: (number-on null f5) (number-on k3 f6)
   goals met: 4 of 10
84. (przesun k5 f2 f5 a)
   deleted: (number-on k5 f2) (number-on null f5)
   added: (number-on null f2) (number-on k5 f5)
   goals met: 5 of 10
85. (przesun k2 f3 f2 a)
   deleted: (number-on k2 f3) (number-on null f2)
   added: (number-on null f3) (number-on k2 f2)
   goals met: 6 of 10
86. (przesun k3 f6 f3 a)
   deleted: (number-on k3 f6) (number-on null f3)
   added: (number-on null f6) (number-on k3 f3)
   goals met: 7 of 10
87. (przesun k6 f9 f6 a)
   deleted: (number-on k6 f9) (number-on null f6)
   added: (number-on null f9) (number-on k6 f6)
   goals met: 9 of 10
88. (idz b a pomaranczowy pi)
   deleted: (merry-ma pi) (merry-w a)
   added: (merry-w b)
   goals met: 9 of 10
89. (wez rozowy rb b)
   deleted: (ball-w rb b)
   added: (merry-ma rb)
   goals met: 9 of 10
90. (idz d b pomaranczowy pc)
   deleted: (merry-ma pc) (merry-w b)
   added: (merry-w d)
   goals met: 9 of 10
91. (idz f d zielony za)
   deleted: (merry-ma za) (merry-w d)
   added: (merry-w f)
   goals met: 9 of 10
92. (idz g f rozowy rb)
   deleted: (merry-ma rb) (merry-w f)
   added: (merry-w g)
   goals met: 10 of 10
